[M_IrisEp2_CultOfPersonality MissionDefinition]
MissionDescription="You're officially enrolled in the Torgue Badass Tournament -- congratulations. If you want to rise up in the leaderboard, you'll have to compete in a number of different events, all while taking out other higher-ranked gladiators.<br><br>Your first event is the Appetite for Destruction, wherein you have to defeat a gang of loosely organized ne'er-do-wells named the Horde of Horrors.<br><br>Kill 'em all."
TurnInDescription="You've survived the Appetite for Destruction and are now the 5th biggest badass in the tournament! Your sponsor, Piston, rewarded your hard work with a weapon chest."

[M_IrisEp2_FindBattle MissionDefinition]
MissionDescription="You've survived the Appetite for Destruction and are now the 5th biggest badass in the tournament! Your sponsor, Piston, rewarded your hard work with a weapon chest.<br><br>An empty weapon chest.<br><br>Something in the air smells funny, and not just metaphorically. You're being betrayed, but what else is new.  Survive whatever is thrown at you for you to get payback later."
TurnInDescription="Pyro Pete will release the sponsor he's kidnapped, but only if you make it worth his while."
MissionSummary="You're being betrayed, but what else is new."

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_11 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Piston has betrayed you. He drugged you, had you taken out of the arena, and convinced everyone that you ran away like a coward.<br><br>Unfortunately, since he was also your sponsor, you are currently unable to rise up in the leaderboards. Mister Torgue has suggested that you head to [place]The Beatdown[-place] and find a new sponsor there."

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_12 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Piston has betrayed you. He drugged you, had you taken out of the arena, and convinced everyone that you ran away like a coward.<br><br>Unfortunately, since he was also your sponsor, you are currently unable to rise up in the leaderboards. Mister Torgue has suggested that you head to [place]The Beatdown[-place] and find a new sponsor there.<br><br>As it turns out, a gladiator named Pyro Pete has kidnapped the sponsor you've been looking for. Find Pete, and find out how to release his sponsor."

[M_IrisEp2_FindBattle:MissionObjectiveSetDefinition_13 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Piston has betrayed you. He drugged you, had you taken out of the arena, and convinced everyone that you ran away like a coward.<br><br>Unfortunately, since he was also your sponsor, you are currently unable to rise up in the leaderboards. Mister Torgue has suggested that you head to [place]The Beatdown[-place] and find a new sponsor there.<br><br>As it turns out, a gladiator named Pyro Pete has kidnapped the sponsor you've been looking for. He'll give the sponsor up, but only if you start some trouble in [place]The Beatdown[-place]. <br><br>You have literally no reason to believe he'll keep his word, but, you know. Eh."

[M_IrisEp2_FindBattle:ReachBeatdown MissionObjectiveDefinition]
ProgressMessage="Reach the Beatdown"

[M_IrisEp2_FindBattle:Waypoint0 MissionObjectiveDefinition]
ProgressMessage="Navigate through the Beatdown"

[M_IrisEp2_FindBattle:Waypoint4 MissionObjectiveDefinition]
ProgressMessage="Navigate through the Beatdown"

[M_IrisEp2_FindBattle:Waypoint5 MissionObjectiveDefinition]
ProgressMessage="Navigate through the Beatdown"
